In [1]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [7]:
ser1 = Series(np.arange(3),index = ['a','b','c'])

In [12]:
ser1
ser1.drop('a')

b    1
c    2
dtype: int64

In [9]:
dframe = DataFrame((np.arange(9).reshape(3,3)), index=['SF','LA','NY']
                   , columns = ['pop','Size','YEar'])

In [10]:
dframe

    pop  Size  YEar
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [13]:
dframe.drop('SF')

    pop  Size  YEar
LA    3     4     5
NY    6     7     8

In [14]:
dframe2 = dframe.drop('SF')

In [15]:
dframe2

    pop  Size  YEar
LA    3     4     5
NY    6     7     8

In [17]:
dframe2.drop('YEar',axis=1)

    pop  Size
LA    3     4
NY    6     7